Revit 2018 API
Asset Class
 Represents a connected property of material.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Syntax
C#
public class Asset : AssetProperties
Visual Basic
Public Class Asset _
	Inherits AssetProperties
Visual C++
public ref class Asset : public AssetProperties
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.AssetProperty
 Autodesk.Revit.DB.Visual.AssetProperties
 Autodesk.Revit.DB.Visual.Asset
See Also
Asset Members
Autodesk.Revit.DB.Visual Namespace